<h1 style= "text-align= center;"> blah blah blah <h1>

In [105]:
import pandas as pd 
import math as math 
import matplotlib.pyplot as plt 
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import mean_squared_error, r2_score

In [92]:
# Here are some imports we'll use through the notebook, collected here for simplicity

# For parsing dates and being able to compare
import datetime

# For fetching remote data
import urllib

# Pandas dataframes and operations
import pandas as pd

# Numpy matrix and array operations
import numpy as np

# Sqlite is a simplistic database
import sqlite3

# Data visualization
import matplotlib

#HAD ISSUES INSTALLING # Crawler for multiple web pages at once
#import scrapy
#from scrapy.crawler import CrawlerProcess
# Can use dataframe.swifter.apply() instead of dataframe.apply()
# to try to parallelize the computation!
#import swifter
# Approximate string matching, see 
#import py_stringsimjoin as ssj
#import py_stringmatching as sm
# import urllib and etree for download and parsing
#from lxml import etree

In [93]:
data = pd.read_csv('data.csv', delimiter=',')
# DELIMITER WHAT SEPERATES THE DATA (;)

print(type(data))

#Aliyah data defined

<class 'pandas.core.frame.DataFrame'>

In [94]:
data_2 = pd.read_csv('CityState.csv', delimiter=',', engine='python', encoding='latin1')

#Jay's data defined

In [95]:
columns_list = ['city', 'state', 'displayName','cost-after-aid']
row = list(range(7000))
new_data = pd.DataFrame(data, index=row, columns=columns_list)
new_data.head(7000)

#Aliyah's data print desired columns

           city state            displayName  cost-after-aid
0     Princeton    NJ   Princeton University         16793.0
1     Cambridge    MA     Harvard University         16338.0
2       Chicago    IL  University of Chicago         27767.0
3     New Haven    CT        Yale University         18385.0
4      New York    NY    Columbia University         21041.0
...         ...   ...                    ...             ...
6995        NaN   NaN                    NaN             NaN
6996        NaN   NaN                    NaN             NaN
6997        NaN   NaN                    NaN             NaN
6998        NaN   NaN                    NaN             NaN
6999        NaN   NaN                    NaN             NaN

[7000 rows x 4 columns]

In [96]:
columns_list = ['City', 'State_ab', 'Mean']
row = list(range(7000))
new_data = pd.DataFrame(data_2, index=row, columns=columns_list)
new_data.head(7000)

#Jay's data print desired columns

                City State_ab    Mean
0          Chickasaw       AL   38773
1         Louisville       AL   37725
2         Columbiana       AL   54606
3            Satsuma       AL   63919
4     Dauphin Island       AL   77948
...              ...      ...     ...
6995   Pompano Beach       FL   50778
6996     Dania Beach       FL   69836
6997   Coral Springs       FL  150858
6998   Coral Springs       FL  119477
6999   Coconut Creek       FL   47168

[7000 rows x 3 columns]

In [97]:
jay_data = data_2[['City', 'State_ab', 'Mean']]
print(jay_data)
#Jay's data print desired columns

                 City State_ab   Mean
0           Chickasaw       AL  38773
1          Louisville       AL  37725
2          Columbiana       AL  54606
3             Satsuma       AL  63919
4      Dauphin Island       AL  77948
...               ...      ...    ...
32521        Guaynabo       PR  30649
32522          Aguada       PR  15520
32523          Aguada       PR  41933
32524          Aguada       PR      0
32525       Aguadilla       PR  28049

[32526 rows x 3 columns]

In [98]:
# Let's take a look at the name and born data in exec_df.  We do this via projection.  
# Notice also (e.g. row 24) that special characters will cause issues.


aliyah_data = data[['city', 'state', 'displayName','cost-after-aid']]
print(aliyah_data)
#Aliyah's data print desired columns

            city state                       displayName  cost-after-aid
0      Princeton    NJ              Princeton University         16793.0
1      Cambridge    MA                Harvard University         16338.0
2        Chicago    IL             University of Chicago         27767.0
3      New Haven    CT                   Yale University         18385.0
4       New York    NY               Columbia University         21041.0
..           ...   ...                               ...             ...
306      Cypress    CA  Trident University International             NaN
307   Cincinnati    OH    Union Institute and University             NaN
308      Phoenix    AZ             University of Phoenix             NaN
309  Minneapolis    MN                 Walden University             NaN
310   New Castle    DE             Wilmington University             NaN

[311 rows x 4 columns]

In [99]:
df = pd.DataFrame(aliyah_data) 
aliyah_clean = df.dropna()
print(aliyah_clean)
#Aliyah data dropped all NaN

           city state                      displayName  cost-after-aid
0     Princeton    NJ             Princeton University         16793.0
1     Cambridge    MA               Harvard University         16338.0
2       Chicago    IL            University of Chicago         27767.0
3     New Haven    CT                  Yale University         18385.0
4      New York    NY              Columbia University         21041.0
..          ...   ...                              ...             ...
145   Corvallis    OR          Oregon State University         36636.0
146   Rochester    NY          St. John Fisher College         28750.0
147     Chicago    IL  University of Illinois--Chicago         39033.0
148  University    MS        University of Mississippi         27943.0
149  Richardson    TX      University of Texas--Dallas         37028.0

[143 rows x 4 columns]

In [100]:
df = pd.DataFrame(jay_data) 
df_dropped = df.dropna()
print(df_dropped)
#Jay data dropped all NaN

                 City State_ab   Mean
0           Chickasaw       AL  38773
1          Louisville       AL  37725
2          Columbiana       AL  54606
3             Satsuma       AL  63919
4      Dauphin Island       AL  77948
...               ...      ...    ...
32521        Guaynabo       PR  30649
32522          Aguada       PR  15520
32523          Aguada       PR  41933
32524          Aguada       PR      0
32525       Aguadilla       PR  28049

[32526 rows x 3 columns]

In [101]:
jay_clean = df_dropped[df_dropped['Mean'] != 0]

print(jay_clean)

#Jay's data that dropped the 0's

                 City State_ab   Mean
0           Chickasaw       AL  38773
1          Louisville       AL  37725
2          Columbiana       AL  54606
3             Satsuma       AL  63919
4      Dauphin Island       AL  77948
...               ...      ...    ...
32520        Adjuntas       PR  23682
32521        Guaynabo       PR  30649
32522          Aguada       PR  15520
32523          Aguada       PR  41933
32525       Aguadilla       PR  28049

[32211 rows x 3 columns]

In [123]:
merged_data = pd.merge(jay_clean, aliyah_clean, left_on='City', right_on='city')
print(merged_data)

           City State_ab   Mean       city state
0     Cleveland       AL  55127  Cleveland    OH  \
1     Cleveland       AL  56385  Cleveland    OH
2     Cleveland       GA  44684  Cleveland    OH
3     Cleveland       MS  34603  Cleveland    OH
4     Cleveland       MS  25632  Cleveland    OH
...         ...      ...    ...        ...   ...
7480  Milwaukee       WI  45808  Milwaukee    WI
7481  Milwaukee       WI  38857  Milwaukee    WI
7482  Milwaukee       WI  59171  Milwaukee    WI
7483  Milwaukee       WI  37089  Milwaukee    WI
7484  Milwaukee       WI  23988  Milwaukee    WI

                          displayName  cost-after-aid
0     Case Western Reserve University         35248.0
1     Case Western Reserve University         35248.0
2     Case Western Reserve University         35248.0
3     Case Western Reserve University         35248.0
4     Case Western Reserve University         35248.0
...                               ...             ...
7480             Marquette University         32894.0
7481             Marquette University         32894.0
7482             Marquette University         32894.0
7483             Marquette University         32894.0
7484             Marquette University         32894.0

[7485 rows x 7 columns]

In [121]:
print(merged_data.head(1))

        City State_ab   Mean    city state        displayName  cost-after-aid
0  Chickasaw       AL  38773  Auburn    AL  Auburn University         39912.0

In [122]:

X = merged_data.iloc[:,2].values.reshape(-1, 1)
y = merged_data.iloc[:,6].values

# Split the data into training and testing sets
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

# Create an instance of the LinearRegression model
model = LinearRegression()


# Train the model on the training data
model.fit(X_train, y_train)

# Make predictions on the testing data
y_pred = model.predict(X_test)

# Evaluate the model
mse = mean_squared_error(y_test, y_pred)
r2 = r2_score(y_test, y_pred)